tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'dart-lang/dart'

# CLI
brew 'git'
brew 'vim'
brew 'fish'
brew 'tree'
brew 'wget'
brew 'mackup'
brew 'python'
brew 'pipenv'
brew 'node'
brew 'yarn'
brew 'go'
brew 'dep'
brew 'hugo'
brew 'dart'
brew 'webp'
brew 'imagemagick'
brew 'wrk'
brew 'peco'
brew 'coreutils'
brew 'ffmpeg'
brew 'nginx', restart_service: :changed
brew 'mariadb', restart_service: :changed
brew 'mtr'
brew 'socat'
brew 'mkcert'
brew 'nss'
brew 'shfmt'
brew 'mackup'
brew 'mas'
brew 'hub'
brew 'tig'
brew 'bat'
brew 'tldr'
brew 'httpie'
brew 'asciinema'
brew 'stow'
brew 'cmake'
brew 'ninja'
brew 'swift'
brew 'usbmuxd', args: ['HEAD'], link: true
brew 'libimobiledevice',  args: ['HEAD']
brew 'ideviceinstaller'
brew 'ios-deploy'
brew 'cocoapods' # Run `pod setup`

# AppStore
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'iBooks Author', id: 490152466
mas 'Wechat', id: 836500024
mas 'WeChat Work', id: 1189898970
mas 'QQ', id: 451108668
mas 'QQ Music', id: 595615424
mas 'Magnet', id: 441258766
mas 'Keka', id: 470158793
mas 'Gifox', id: 1082624744
mas 'Reeder', id: 880001334
mas 'Take a break', id: 1457158844
mas 'Unsplash Wallpapers', id: 1284863847

# GUI
cask 'google-chrome'
cask 'firefox'
cask 'shadowsocksx-ng'
cask 'keepassxc'
cask 'hyper'
cask 'visual-studio-code'
cask 'wechatwebdevtools'
cask 'insomnia'
cask 'gpg-suite'
cask 'google-backup-and-sync'
cask 'google-cloud-sdk'
cask 'now'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'docker'
cask 'postgres'
cask 'mongodb'
cask 'redis'
cask 'pgadmin4'
cask 'sequel-pro'
cask 'sketch'
cask 'figma'
cask 'xmind'
cask 'macdown'
cask 'thunder'
cask 'iina'
cask 'kap'
cask 'obs'
cask 'sip'
cask 'imageoptim'
cask 'fontplop'
cask 'baidunetdisk'
cask 'chrome-remote-desktop-host'
cask 'graphql-playground'
cask 'java'
cask 'android-sdk'
cask 'android-studio'
cask 'notion'
cask 'pock'
cask 'openinterminal'
cask 'aerial'
cask 'openemu'
cask 'balenaetcher'
cask 'nteract'

# Quicklook
cask 'qlstephen'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'provisionql'
cask 'quicklookapk'
cask 'webpquicklook'
cask 'quicklookase'
cask 'quicklook-pat'

# Fonts
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-fira-sans'
cask 'font-fira-mono'
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-roboto-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fantasque-sans-mono'
cask 'font-noto-sans'
cask 'font-noto-serif'
cask 'font-noto-sans-cjk'
cask 'font-noto-serif-cjk'
cask 'font-noto-mono'
cask 'font-noto-emoji'
cask 'font-noto-color-emoji'

# No brew or cask yet
# brew 'edgedb'
# cask 'pixelsnap'
