tap 'homebrew/cask'
tap 'dart-lang/dart'

# CLI
brew 'git'
brew 'vim'
brew 'fish'
brew 'tree'
brew 'wget'
brew 'mackup'
brew 'python'
brew 'pipenv'
brew 'node'
brew 'yarn'
brew 'go'
brew 'dep'
brew 'hugo'
brew 'dart'
brew 'mariadb'
brew 'mtr'
brew 'socat'
brew 'mkcert'
brew 'nss'
brew 'mas'

# AppStore
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'iBooks Author', id: 490152466
mas 'Wechat', id: 836500024
mas 'QQ', id: 451108668
mas 'QQ Music', id: 595615424
mas 'Magnet', id: 441258766
mas 'Keka', id: 470158793
mas 'Gifox', id: 1082624744
mas 'Reeder', id: 880001334
mas 'Take a break', id: 1457158844

# GUI
cask 'google-chrome'
cask 'firefox'
cask 'shadowsocksx-ng'
cask 'keepassxc'
cask 'hyper'
cask 'visual-studio-code'
cask 'wechatwebdevtools'
cask 'insomnia'
cask 'virtualbox'
cask 'docker'
cask 'postgres'
cask 'mongodb'
cask 'redis'
cask 'pgadmin4'
cask 'sequel-pro'
cask 'sketch'
cask 'figma'
cask 'xmind'
cask 'dash'
cask 'macdown'
cask 'thunder'
cask 'iina'
cask 'kap'
cask 'obs'
cask 'sip'
cask 'imageoptim'
cask 'fontplop'
cask 'baidunetdisk'
cask 'chrome-remote-desktop-host'
cask 'google-cloud-sdk'
cask 'graphql-playground'

# Misc
# cask 'pixelsnap'
