tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

# Brews
brew 'cmake'
brew 'coreutils'
brew 'curl'
Brew 'deno'
brew 'dep'
brew 'ffmpeg'
brew 'fish'
brew 'git'
brew 'git-extras'
brew 'go'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'imagemagick'
brew 'lua'
brew 'luarocks'
brew 'mariadb', restart_service: :changed
brew 'mkcert'
brew 'mtr'
brew 'node'
brew 'nss'
brew 'peco'
brew 'pipenv'
brew 'python'
brew 'ruby'
brew 'rustup'
brew 'socat'
brew 'sqlite'
brew 'tig'
brew 'tldr'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'wrk'
brew 'yarn'
brew 'youtube-dl'

# Casks
cask 'aerial'
cask 'balenaetcher'
cask 'figma'
cask 'firefox'
cask 'fontplop'
cask 'google-chrome'
cask 'hyper'
cask 'iina'
cask 'imageoptim'
cask 'kap'
cask 'macpass'
cask 'microsoft-edge'
cask 'ngrok'
cask 'obs'
cask 'one-switch'
cask 'openinterminal'
cask 'pixelsnap'
cask 'postgres'
cask 'redis'
cask 'sequel-pro'
cask 'shadowsocksx-ng-r'
cask 'sip'
cask 'sketch'
cask 'thunder'
cask 'visual-studio-code'
cask 'wechatwebdevtools'
cask 'xmind'

# Quicklook
cask 'qlstephen'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'provisionql'
cask 'quicklookapk'
cask 'webpquicklook'

# Fonts
cask 'font-cascadia'
cask 'font-fira-code'
